AaroSnid/stm32-drivers/W25Q64JV/W25Q64JV_registers.h
#ifndef W25Q64JV_REGISTERS_H_
#define W25Q64JV_REGISTERS_H_

#define WRITE_ENABLE 0x06
#define VOLATILE_SR_WRITE_ENABLE 0x50
#define WRITE_DISABLE 0x04
#define RELEASE_POWER_DOWN 0xAB
#define MANUFACTURER_DEVICE_ID 0x90
#define JEDEC_ID 0x9F
#define READ_UNIQUE_ID 0x4B
#define READ_DATA 0x03
#define FAST_READ 0x0B
#define PAGE_RPOGRAM 0x02
#define SECTOR_ERASE_4KB 0x20
#define BLOCK_ERASE_32KB 0x52
#define BLOCK_ERASE_64KB 0xD8
#define CHIP_ERASE C7h/60h
#define READ_STATUS_REGISTER_1 0x05
#define WRITE_STATUS_REGISTER_1 0x01
#define READ_STATUS_REGISTER_2 0x35
#define WRITE_STATUS_REGISTER_2 0x31
#define READ_STATUS_REGISTER_3 0x15
#define WRITE_STATUS_REGISTER_3 0x11 
#define READ_SFDP_REGISTER 0x5A
#define ERASE_SECURITY_REGISTER 0x44
#define PROGRAM_SECURITY_REGISTER 0x42
#define READ_SECURITY_REGISTER 0x48
#define GLOBAL_BLOCK_LOCK 0x7E
#define GLOBAL_BLOCK_UNLOCK 0x98
#define READ_BLOCK_LOCK 0x3D
#define INDIVIDUAL_BLOCK_LOCK 0x36
#define INDIVIDUAL_CLOCK_UNLOCK 0x39
#define ERASE_PROGRAM_SUSPEND 0x75
#define ERASE_PROGRAM_RESUME 0x7A
#define POWER_DOWN 0xB9
#define ENABLE_RESET 0x66
#define RESET_DEVICE 0x99

// Number of Clock(1-1-2) 8 8 8 8 4 4 4 4 4
#define FAST_READ_DUAL_OUTPUT 0x3B
// Number of Clock(1-2-2) 8 4 4 4 4 4 4 4 4
#define FAST_READ_DUAL_IO 0xBB
#define MFTR_DEVICE_ID_DUAK_IO 0x92
// Number of Clock(1-1-4) 8 8 8 8 2 2 2 2 2
#define QUAD_INPUT_PAGE_PROGRAM 0x32
#define FAST_READ_QUAD_OUTPUT 0x6B
// Number of Clock(1-4-4) 8 2(8) 2(8) 2(8) 2 2 2 2 2
#define MFTR_DEVICE_ID_QUAD_IO 0x94
#define FAST_READ_QUAD_IO 0xEB
#define SET_BURST_WITH_WRAP 0x77

#endif /* W25Q64JV_REGISTERS_H_ */